app/views/users/show.html.erb

SELECT "wikis".* FROM "wikis" WHERE "wikis"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 1]]
---

<% @user.wikis.each do |wiki| %>