app/controllers/charges_controller.rb

def create
  # Creates a Stripe Customer object, for associating
  # with the charge
  customer = Stripe::Customer.create(
   email: current_user.email,
   card: params[:stripeToken]
)

  # Where the real magic happens
  charge = Stripe::Charge.create(
   customer: customer.id, # Note -- this is NOT the user_id in your app
   amount: Amount.default,
   description: "Premium subscription - #{current_user.email}",
   currency: 'usd'
  )

  current_user.update_attribute(:role, 'premium')
---
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 1], ["updated_at", "2016-02-27 16:14:37.487152"], ["id", 4]]

def downgrade
    current_user.update_attributes(role: 'standard')
---
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 0], ["updated_at", "2016-02-26 22:26:50.041889"], ["id", 3]]