app/controllers/wikis_controller.rb

  def index
    #@wikis = Wiki.where(private: false)
    @wikis = Wiki.all
---
SELECT "wikis".* FROM "wikis"  ORDER BY created_at DESC

  def show
    @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 52]]

  def create
    @wiki = Wiki.new(params.require(:wiki).permit(:title, :body, :private, false))
    authorize @wiki

    if @wiki.save
---
INSERT INTO "wikis" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sdfasdfsadfasdf"], ["body", "sadfasdfasdfasdfsadfasdf"], ["user_id", 2], ["created_at", "2016-02-26 19:55:59.802532"], ["updated_at", "2016-02-26 19:55:59.802532"]]

  def edit
    @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 51]]

  def update
    @wiki = Wiki.find(params[:id])
    authorize @wiki

    if @wiki.update_attributes(params.require(:wiki).permit(:title, :body, :private))
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 51]]
UPDATE "wikis" SET "title" = ?, "private" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["title", "*111111Perferendis ea quia molestiae officia.*"], ["private", "t"], ["updated_at", "2016-03-10 23:11:32.217969"], ["id", 3]]

  def destroy
    @wiki = Wiki.find(params[:id])
    title = @wiki.title
    authorize @wiki

    if @wiki.destroy
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 52]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 2]]