app/controllers/wikis_controller.rb

SELECT "users".* FROM "users"
---
  def edit
    @user = @wiki.user
    @users = User.all